##### Reading   OBE Marksheet

Evaluation ID, Student_Enrollment, Assessments ID, Obtain Marks

In [86]:
import pandas as pd
file = pd.read_excel('CSE101 OBE Mark Sheet.xlsx')

In [87]:
file.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Final Total,Final Total Converted,Project Work,Project Work Total,Total,Unnamed: 22,CO Total,Unnamed: 24,Unnamed: 25,Unnamed: 26
0,NaN,NaN,NaN,NaN,NaN,CO1,CO1,CO1,CO2,CO1,...,100.0,40.0,CO4,30.0,100.0,NaN,CO1,CO2,CO3,CO4
1,NaN,NaN,NaN,NaN,NaN,Q1,Q2,Q3,Q4,Q5,...,NaN,NaN,Lab,NaN,NaN,NaN,165,35,50,30
2,NaN,NaN,NaN,NaN,NaN,25,25,30,20,30,...,NaN,NaN,30,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,1416455.0,CSE101,1.0,Summer,15,0,5,15,2,...,65.0,26.0,24,24.0,67.0,8.2,55,26,28,24
4,2.0,1579288.0,CSE101,1.0,Summer,0,0,18,0,5,...,46.0,18.4,23,23.0,57.0,8.6,45,13,23,23

In [88]:
file.tail()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Final Total,Final Total Converted,Project Work,Project Work Total,Total,Unnamed: 22,CO Total,Unnamed: 24,Unnamed: 25,Unnamed: 26
86,84.0,1868128.0,CSE101,1.0,Summer,15,15,24,15,4,...,69.0,27.6,27,27.0,81.0,8.8,104,26,27,27
87,85.0,1845457.0,CSE101,1.0,Summer,0,0,20,0,0,...,0.0,0.0,0,0.0,12.0,8.0,20,0,0,0
88,86.0,1855787.0,CSE101,2.0,Summer,20,15,26,10,0,...,51.0,20.4,23,23.0,66.0,8.4,83,24,15,23
89,87.0,1893863.0,CSE101,2.0,Summer,0,0,20,6,0,...,0.0,0.0,0,0.0,14.0,8.8,20,6,0,0
90,88.0,1842333.0,CSE101,2.0,Summer,20,0,15,14,6,...,52.0,20.8,25,25.0,65.0,8.2,67,25,15,25

##### Evaluation For Midterm Questions

In [103]:
# Taking columns for Q1
mid_q1 = file.iloc[3:, :6]
mid_q1.head()

   Serial         ID Course ID  Section  Semester Midterm
3     1.0  1416455.0    CSE101       1.0   Summer      15
4     2.0  1579288.0    CSE101       1.0   Summer       0
5     3.0  1528882.0    CSE101       3.0   Summer      15
6     4.0  1653725.0    CSE101       3.0   Summer       0
7     5.0  1625654.0    CSE101       1.0   Summer       5

In [104]:
# Dropping 2 columns as we needed 4 columns 
q1 = mid_q1.drop(mid_q1.columns[[2,3]], axis= 1)
q1.head()

   Serial         ID Semester Midterm
3     1.0  1416455.0   Summer      15
4     2.0  1579288.0   Summer       0
5     3.0  1528882.0   Summer      15
6     4.0  1653725.0   Summer       0
7     5.0  1625654.0   Summer       5

In [105]:
# Cnverting q1 as a list
midterm_q1_l = q1.values.tolist()
print(midterm_q1_l[1])

[2.0, 1579288.0, 'Summer', 0]

In [106]:
# To get question no. for assessments ID
to_list = file.values.tolist()
question_no = to_list[1:][0][5]
print("Question number is: ",question_no)

Question number is:  Q1

In [107]:
print(midterm_q1_l[3])

[4.0, 1653725.0, 'Summer', 0]

In [108]:
for i in range(len(midterm_q1_l)):
    midterm_q1_l[i][0] = 100000 + i
    midterm_q1_l[i][1] = 1000 + i
    midterm_q1_l[i][2] = 'CSE101_Mid_' + question_no   # As our assessments ID named like this
    
print(midterm_q1_l[1])

[100001, 1001, 'CSE101_Mid_Q1', 0]

In [109]:
# Converting list dataframe
df = pd.DataFrame(midterm_q1_l,columns=['Evaluation ID', 'Student_Enrollment', 'Assessments ID', 'Obtain Marks'] )
df.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0         100000                1000  CSE101_Mid_Q1            15
1         100001                1001  CSE101_Mid_Q1             0
2         100002                1002  CSE101_Mid_Q1            15
3         100003                1003  CSE101_Mid_Q1             0
4         100004                1004  CSE101_Mid_Q1             5

In [110]:
df.to_excel('evaluation_for_cse101_mid_q1.xlsx')

Evaluation for question 2

In [111]:
# Taking columns for Q2
mid_q2 = file.iloc[3:, :7]
mid_q2.head()

   Serial         ID Course ID  Section  Semester Midterm Unnamed: 6
3     1.0  1416455.0    CSE101       1.0   Summer      15          0
4     2.0  1579288.0    CSE101       1.0   Summer       0          0
5     3.0  1528882.0    CSE101       3.0   Summer      15          7
6     4.0  1653725.0    CSE101       3.0   Summer       0          0
7     5.0  1625654.0    CSE101       1.0   Summer       5         15

In [112]:
# Dropping 3 columns as we needed 4 columns 
q2 = mid_q2.drop(mid_q2.columns[[2,3,4]], axis= 1)
q2.head()

   Serial         ID Midterm Unnamed: 6
3     1.0  1416455.0      15          0
4     2.0  1579288.0       0          0
5     3.0  1528882.0      15          7
6     4.0  1653725.0       0          0
7     5.0  1625654.0       5         15

In [113]:
# Cnverting q2 as a list
midterm_q2_l = q2.values.tolist()
print(midterm_q2_l[1])

[2.0, 1579288.0, 0, 0]

In [114]:
# To get question no. for assessments ID
to_list = file.values.tolist()
question_no = to_list[1:][0][6]         # can be write as funtion
print("Question number is: ",question_no)

Question number is:  Q2

In [115]:
for i in range(len(midterm_q2_l)):
    midterm_q2_l[i][0] = 110000 + i
    midterm_q2_l[i][1] = 1000 + i
    midterm_q2_l[i][2] = 'CSE101_Mid_' + question_no   # As our assessments ID named like this
    
print(midterm_q2_l[13])

[110013, 1013, 'CSE101_Mid_Q2', 0]

In [116]:
# Converting list dataframe
df = pd.DataFrame(midterm_q2_l,columns=['Evaluation ID', 'Student_Enrollment', 'Assessments ID', 'Obtain Marks'] )
df.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0         110000                1000  CSE101_Mid_Q2             0
1         110001                1001  CSE101_Mid_Q2             0
2         110002                1002  CSE101_Mid_Q2             7
3         110003                1003  CSE101_Mid_Q2             0
4         110004                1004  CSE101_Mid_Q2            15

In [117]:
df.to_excel('evaluation_for_cse101_mid_q2.xlsx')

Evaluation for question 3

In [118]:
# Taking columns for Q3
mid_q3 = file.iloc[3:, :8]
mid_q3.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7
3,1.0,1416455.0,CSE101,1.0,Summer,15,0,5
4,2.0,1579288.0,CSE101,1.0,Summer,0,0,18
5,3.0,1528882.0,CSE101,3.0,Summer,15,7,0
6,4.0,1653725.0,CSE101,3.0,Summer,0,0,0
7,5.0,1625654.0,CSE101,1.0,Summer,5,15,20

In [119]:
# Dropping 4 columns as we needed 4 columns 
q3 = mid_q3.drop(mid_q3.columns[[2,3,4,5]], axis= 1)
q3.head()

   Serial         ID Unnamed: 6 Unnamed: 7
3     1.0  1416455.0          0          5
4     2.0  1579288.0          0         18
5     3.0  1528882.0          7          0
6     4.0  1653725.0          0          0
7     5.0  1625654.0         15         20

In [120]:
# Function to get question number

def get_question_no(file, column_number):
    to_list = file.values.tolist()                      # file is the full data which we loaded first
    question_no = to_list[1:][0][column_number]         # can be write as funtion
    print("Question number is: ",question_no)
    return question_no

In [121]:
mid_question_3 = get_question_no(file, 7)   # q3 is on column 7
print(mid_question_3)
#print(type(mid_question_3))

Question number is:  Q3
Q3

In [122]:
# Function to modify column values for evaluation

def modify(eval_id, evaluate_data, question_no, exam):
    evaluate_data_l = evaluate_data.values.tolist()
    #print("Before: ", evaluate_data_l[0])
    for i in range(len(evaluate_data_l)):
        evaluate_data_l[i][0] = eval_id + i
        evaluate_data_l[i][1] = 1000 + i
        evaluate_data_l[i][2] = exam + question_no   # As our assessments ID named like this
    #print('After: ', evaluate_data_l[0])
    #return evaluate_data_l
    df = pd.DataFrame(evaluate_data_l,columns=['Evaluation ID', 'Student_Enrollment', 'Assessments ID', 'Obtain Marks'] )
    return df

In [123]:
question_3 = modify(120000, q3, mid_question_3, 'CSE101_Mid_')
#print(question_3[1])

In [124]:
question_3.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0         120000                1000  CSE101_Mid_Q3             5
1         120001                1001  CSE101_Mid_Q3            18
2         120002                1002  CSE101_Mid_Q3             0
3         120003                1003  CSE101_Mid_Q3             0
4         120004                1004  CSE101_Mid_Q3            20

In [125]:
# Saving as Excel sheet
question_3.to_excel('evaluation_for_cse101_mid_q3.xlsx')

Evaluation for Midterm question 4

In [126]:
# Taking columns for Q4
mid_q4 = file.iloc[3:, :9]
mid_q4.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8
3,1.0,1416455.0,CSE101,1.0,Summer,15,0,5,15
4,2.0,1579288.0,CSE101,1.0,Summer,0,0,18,0
5,3.0,1528882.0,CSE101,3.0,Summer,15,7,0,0
6,4.0,1653725.0,CSE101,3.0,Summer,0,0,0,0
7,5.0,1625654.0,CSE101,1.0,Summer,5,15,20,0

In [127]:
# Dropping 5 columns as we needed 4 columns 
q4 = mid_q4.drop(mid_q4.columns[[2,3,4,5,6]], axis= 1)
q4.head()

   Serial         ID Unnamed: 7 Unnamed: 8
3     1.0  1416455.0          5         15
4     2.0  1579288.0         18          0
5     3.0  1528882.0          0          0
6     4.0  1653725.0          0          0
7     5.0  1625654.0         20          0

In [128]:
# Getting question number
mid_question_4 = get_question_no(file, 8)   # q4 is on column 8
print(mid_question_4)

Question number is:  Q4
Q4

In [129]:
# Modify column values
question_4 = modify(130000, q4, mid_question_4, 'CSE101_Mid_')

In [130]:
# printing the modified data
question_4.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0         130000                1000  CSE101_Mid_Q4            15
1         130001                1001  CSE101_Mid_Q4             0
2         130002                1002  CSE101_Mid_Q4             0
3         130003                1003  CSE101_Mid_Q4             0
4         130004                1004  CSE101_Mid_Q4             0

In [131]:
# Saving as Excel sheet
question_4.to_excel('evaluation_for_cse101_mid_q4.xlsx')

Evaluation for question 5

In [132]:
# Taking columns for Q5
mid_q5 = file.iloc[3:, :10]
mid_q5.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
3,1.0,1416455.0,CSE101,1.0,Summer,15,0,5,15,2
4,2.0,1579288.0,CSE101,1.0,Summer,0,0,18,0,5
5,3.0,1528882.0,CSE101,3.0,Summer,15,7,0,0,0
6,4.0,1653725.0,CSE101,3.0,Summer,0,0,0,0,0
7,5.0,1625654.0,CSE101,1.0,Summer,5,15,20,0,0

In [133]:
# Dropping 6 columns as we needed 4 columns 
q5 = mid_q5.drop(mid_q5.columns[[2,3,4,5,6,7]], axis= 1)
q5.head()

   Serial         ID Unnamed: 8 Unnamed: 9
3     1.0  1416455.0         15          2
4     2.0  1579288.0          0          5
5     3.0  1528882.0          0          0
6     4.0  1653725.0          0          0
7     5.0  1625654.0          0          0

In [134]:
# Getting question number
mid_question_5 = get_question_no(file, 9)   # q5 is on column 9
print(mid_question_5)

Question number is:  Q5
Q5

In [135]:
# Modify column values
question_5 = modify(140000, q5, mid_question_5, 'CSE101_Mid_')

In [136]:
# printing the modified data
question_5.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0         140000                1000  CSE101_Mid_Q5             2
1         140001                1001  CSE101_Mid_Q5             5
2         140002                1002  CSE101_Mid_Q5             0
3         140003                1003  CSE101_Mid_Q5             0
4         140004                1004  CSE101_Mid_Q5             0

In [137]:
# Saving as Excel sheet
question_5.to_excel('evaluation_for_cse101_mid_q5.xlsx')

Evavulation question 6

In [138]:
# Taking columns for Q6
mid_q6 = file.iloc[3:, :11]
mid_q6.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
3,1.0,1416455.0,CSE101,1.0,Summer,15,0,5,15,2,7
4,2.0,1579288.0,CSE101,1.0,Summer,0,0,18,0,5,12
5,3.0,1528882.0,CSE101,3.0,Summer,15,7,0,0,0,4
6,4.0,1653725.0,CSE101,3.0,Summer,0,0,0,0,0,0
7,5.0,1625654.0,CSE101,1.0,Summer,5,15,20,0,0,0

In [139]:
# Dropping 7 columns as we needed 4 columns 
q6 = mid_q6.drop(mid_q6.columns[[2,3,4,5,6,7,8]], axis= 1)
q6.head()

   Serial         ID Unnamed: 9 Unnamed: 10
3     1.0  1416455.0          2           7
4     2.0  1579288.0          5          12
5     3.0  1528882.0          0           4
6     4.0  1653725.0          0           0
7     5.0  1625654.0          0           0

In [140]:
# Getting question number
mid_question_6 = get_question_no(file, 10)   # q5 is on column 10
print(mid_question_6)

Question number is:  Q6
Q6

In [141]:
# Modify column values
question_6 = modify(150000, q6, mid_question_6, 'CSE101_Mid_')

In [142]:
question_6.head()

   Evaluation ID  Student_Enrollment Assessments ID  Obtain Marks
0         150000                1000  CSE101_Mid_Q6             7
1         150001                1001  CSE101_Mid_Q6            12
2         150002                1002  CSE101_Mid_Q6             4
3         150003                1003  CSE101_Mid_Q6             0
4         150004                1004  CSE101_Mid_Q6             0

In [143]:
# Saving as Excel sheet
question_6.to_excel('evaluation_for_cse101_mid_q6.xlsx')

##### Evaluation For Final Questions

In [144]:
file.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Final Total,Final Total Converted,Project Work,Project Work Total,Total,Unnamed: 22,CO Total,Unnamed: 24,Unnamed: 25,Unnamed: 26
0,NaN,NaN,NaN,NaN,NaN,CO1,CO1,CO1,CO2,CO1,...,100.0,40.0,CO4,30.0,100.0,NaN,CO1,CO2,CO3,CO4
1,NaN,NaN,NaN,NaN,NaN,Q1,Q2,Q3,Q4,Q5,...,NaN,NaN,Lab,NaN,NaN,NaN,165,35,50,30
2,NaN,NaN,NaN,NaN,NaN,25,25,30,20,30,...,NaN,NaN,30,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,1416455.0,CSE101,1.0,Summer,15,0,5,15,2,...,65.0,26.0,24,24.0,67.0,8.2,55,26,28,24
4,2.0,1579288.0,CSE101,1.0,Summer,0,0,18,0,5,...,46.0,18.4,23,23.0,57.0,8.6,45,13,23,23

In [145]:
# Taking columns for Q6
final_index = file.iloc[0:, :14]
final_index.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Midterm Total,Midterm Total Converted,Final
0,NaN,NaN,NaN,NaN,NaN,CO1,CO1,CO1,CO2,CO1,CO1,150.0,30.0,CO1
1,NaN,NaN,NaN,NaN,NaN,Q1,Q2,Q3,Q4,Q5,Q6,NaN,NaN,Q1
2,NaN,NaN,NaN,NaN,NaN,25,25,30,20,30,20,NaN,NaN,20
3,1.0,1416455.0,CSE101,1.0,Summer,15,0,5,15,2,7,44.0,8.8,13
4,2.0,1579288.0,CSE101,1.0,Summer,0,0,18,0,5,12,35.0,7.0,NaN

In [146]:
final_index = file.iloc[0:, :18]
final_index.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Midterm Total,Midterm Total Converted,Final,Unnamed: 14,Unnamed: 15,Unnamed: 16,Final Total
0,NaN,NaN,NaN,NaN,NaN,CO1,CO1,CO1,CO2,CO1,CO1,150.0,30.0,CO1,CO1,CO2,CO3,100.0
1,NaN,NaN,NaN,NaN,NaN,Q1,Q2,Q3,Q4,Q5,Q6,NaN,NaN,Q1,Q2,Q3,Q4,NaN
2,NaN,NaN,NaN,NaN,NaN,25,25,30,20,30,20,NaN,NaN,20,15,15,50,NaN
3,1.0,1416455.0,CSE101,1.0,Summer,15,0,5,15,2,7,44.0,8.8,13,13,11,28,65.0
4,2.0,1579288.0,CSE101,1.0,Summer,0,0,18,0,5,12,35.0,7.0,NaN,10,13,23,46.0

Evaluation for final question 1

In [147]:
# Final Questions starts with column 14 and ends with 17
# Taking columns for Q1
final_q1 = file.iloc[3:, :14]
final_q1.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Midterm Total,Midterm Total Converted,Final
3,1.0,1416455.0,CSE101,1.0,Summer,15,0,5,15,2,7,44.0,8.8,13
4,2.0,1579288.0,CSE101,1.0,Summer,0,0,18,0,5,12,35.0,7.0,NaN
5,3.0,1528882.0,CSE101,3.0,Summer,15,7,0,0,0,4,26.0,5.2,2
6,4.0,1653725.0,CSE101,3.0,Summer,0,0,0,0,0,0,0.0,0.0,NaN
7,5.0,1625654.0,CSE101,1.0,Summer,5,15,20,0,0,0,40.0,8.0,8

In [148]:
# Dropping columns as we needed 4 columns 
fq1 = final_q1.drop(final_q1.columns[[2,3,4,5,6,7,8, 9, 10, 11]], axis= 1)
fq1.head()

   Serial         ID  Midterm Total Converted Final
3     1.0  1416455.0                      8.8     13
4     2.0  1579288.0                      7.0    NaN
5     3.0  1528882.0                      5.2      2
6     4.0  1653725.0                      0.0    NaN
7     5.0  1625654.0                      8.0      8

In [149]:
# Getting question number
final_question_1 = get_question_no(file, 13)   # q1 is on column 13
print(final_question_1)

Question number is:  Q1
Q1

In [150]:
# Modify column values
f_question_1 = modify(160000, fq1, final_question_1, 'CSE101_Final_')

In [151]:
f_question_1.head()

   Evaluation ID  Student_Enrollment   Assessments ID  Obtain Marks
0         160000                1000  CSE101_Final_Q1          13.0
1         160001                1001  CSE101_Final_Q1           NaN
2         160002                1002  CSE101_Final_Q1           2.0
3         160003                1003  CSE101_Final_Q1           NaN
4         160004                1004  CSE101_Final_Q1           8.0

In [152]:
# Saving as Excel sheet
f_question_1.to_excel('evaluation_for_cse101_final_q1.xlsx')

Evaluation final question 2

In [155]:
# Final Questions starts with column 14 and ends with 17
# Taking columns for Q2
final_q2 = file.iloc[3:, :15]
final_q2.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Midterm Total,Midterm Total Converted,Final,Unnamed: 14
3,1.0,1416455.0,CSE101,1.0,Summer,15,0,5,15,2,7,44.0,8.8,13,13
4,2.0,1579288.0,CSE101,1.0,Summer,0,0,18,0,5,12,35.0,7.0,NaN,10
5,3.0,1528882.0,CSE101,3.0,Summer,15,7,0,0,0,4,26.0,5.2,2,7
6,4.0,1653725.0,CSE101,3.0,Summer,0,0,0,0,0,0,0.0,0.0,NaN,NaN
7,5.0,1625654.0,CSE101,1.0,Summer,5,15,20,0,0,0,40.0,8.0,8,10

In [156]:
# Dropping columns as we needed 4 columns 
fq2 = final_q2.drop(final_q2.columns[[2,3,4,5,6,7,8, 9, 10, 11, 12]], axis= 1)
fq2.head()

   Serial         ID Final  Unnamed: 14
3     1.0  1416455.0     13          13
4     2.0  1579288.0    NaN          10
5     3.0  1528882.0      2           7
6     4.0  1653725.0    NaN         NaN
7     5.0  1625654.0      8          10

In [157]:
# Getting question number
final_question_2 = get_question_no(file, 14)   # q2 is on column 14
print(final_question_2)

Question number is:  Q2
Q2

In [158]:
# Modify column values
f_question_2 = modify(170000, fq2, final_question_2, 'CSE101_Final_')

In [159]:
f_question_2.head()

   Evaluation ID  Student_Enrollment   Assessments ID  Obtain Marks
0         170000                1000  CSE101_Final_Q2          13.0
1         170001                1001  CSE101_Final_Q2          10.0
2         170002                1002  CSE101_Final_Q2           7.0
3         170003                1003  CSE101_Final_Q2           NaN
4         170004                1004  CSE101_Final_Q2          10.0

In [160]:
# Saving as Excel sheet
f_question_2.to_excel('evaluation_for_cse101_final_q2.xlsx')

Evaluation for final question 3

In [161]:
# Final Questions starts with column 14 and ends with 17
# Taking columns for Q3
final_q3 = file.iloc[3:, :16]
final_q3.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Midterm Total,Midterm Total Converted,Final,Unnamed: 14,Unnamed: 15
3,1.0,1416455.0,CSE101,1.0,Summer,15,0,5,15,2,7,44.0,8.8,13,13,11
4,2.0,1579288.0,CSE101,1.0,Summer,0,0,18,0,5,12,35.0,7.0,NaN,10,13
5,3.0,1528882.0,CSE101,3.0,Summer,15,7,0,0,0,4,26.0,5.2,2,7,8
6,4.0,1653725.0,CSE101,3.0,Summer,0,0,0,0,0,0,0.0,0.0,NaN,NaN,NaN
7,5.0,1625654.0,CSE101,1.0,Summer,5,15,20,0,0,0,40.0,8.0,8,10,10

In [162]:
# Dropping columns as we needed 4 columns 
fq3 = final_q3.drop(final_q3.columns[[2,3,4,5,6,7,8, 9, 10, 11, 12, 13]], axis= 1)
fq3.head()

   Serial         ID Unnamed: 14 Unnamed: 15
3     1.0  1416455.0          13          11
4     2.0  1579288.0          10          13
5     3.0  1528882.0           7           8
6     4.0  1653725.0         NaN         NaN
7     5.0  1625654.0          10          10

In [163]:
# Getting question number
final_question_3 = get_question_no(file, 15)   # q3 is on column 15
print(final_question_3)

Question number is:  Q3
Q3

In [164]:
# Modify column values
f_question_3 = modify(180000, fq3, final_question_3, 'CSE101_Final_')

In [165]:
f_question_3.head()

   Evaluation ID  Student_Enrollment   Assessments ID  Obtain Marks
0         180000                1000  CSE101_Final_Q3          11.0
1         180001                1001  CSE101_Final_Q3          13.0
2         180002                1002  CSE101_Final_Q3           8.0
3         180003                1003  CSE101_Final_Q3           NaN
4         180004                1004  CSE101_Final_Q3          10.0

In [166]:
# Saving as Excel sheet
f_question_3.to_excel('evaluation_for_cse101_final_q3.xlsx')

Evaluation for question 3

In [167]:
# Final Questions starts with column 14 and ends with 17
# Taking columns for Q4
final_q4 = file.iloc[3:, :17]
final_q4.head()

,Serial,ID,Course ID,Section,Semester,Midterm,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Midterm Total,Midterm Total Converted,Final,Unnamed: 14,Unnamed: 15,Unnamed: 16
3,1.0,1416455.0,CSE101,1.0,Summer,15,0,5,15,2,7,44.0,8.8,13,13,11,28
4,2.0,1579288.0,CSE101,1.0,Summer,0,0,18,0,5,12,35.0,7.0,NaN,10,13,23
5,3.0,1528882.0,CSE101,3.0,Summer,15,7,0,0,0,4,26.0,5.2,2,7,8,13
6,4.0,1653725.0,CSE101,3.0,Summer,0,0,0,0,0,0,0.0,0.0,NaN,NaN,NaN,0
7,5.0,1625654.0,CSE101,1.0,Summer,5,15,20,0,0,0,40.0,8.0,8,10,10,4

In [168]:
# Dropping columns as we needed 4 columns 
fq4 = final_q4.drop(final_q4.columns[[2,3,4,5,6,7,8, 9, 10, 11, 12, 13, 14]], axis= 1)
fq4.head()

   Serial         ID Unnamed: 15 Unnamed: 16
3     1.0  1416455.0          11          28
4     2.0  1579288.0          13          23
5     3.0  1528882.0           8          13
6     4.0  1653725.0         NaN           0
7     5.0  1625654.0          10           4

In [169]:
# Getting question number
final_question_4 = get_question_no(file, 16)   # q4 is on column 16
print(final_question_4)

Question number is:  Q4
Q4

In [170]:
# Modify column values
f_question_4 = modify(190000, fq4, final_question_4, 'CSE101_Final_')

In [171]:
f_question_4.head()

   Evaluation ID  Student_Enrollment   Assessments ID  Obtain Marks
0         190000                1000  CSE101_Final_Q4            28
1         190001                1001  CSE101_Final_Q4            23
2         190002                1002  CSE101_Final_Q4            13
3         190003                1003  CSE101_Final_Q4             0
4         190004                1004  CSE101_Final_Q4             4

In [172]:
# Saving as Excel sheet
f_question_4.to_excel('evaluation_for_cse101_final_q4.xlsx')